So the goal of this assignment is to 1. group users as adopted and non-adopted. 2. Identify the features that determine future adoptions. 
I did a quick look at the csv files, and oh no, we are going to have to work with time-data. Time-data is a very weak skill of mine so forgive if this looks absolutely horrendous. But here goes nothing.

In [96]:
# import pandas
import pandas as pd
import datetime

eng_df = pd.read_csv('takehome_user_engagement.csv', header = 0, encoding='latin-1')
user_df = pd.read_csv('takehome_users.csv', header = 0, encoding = 'latin-1')

In [97]:
eng_df.head(20)

             time_stamp  user_id  visited
0   2014-04-22 03:53:30        1        1
1   2013-11-15 03:45:04        2        1
2   2013-11-29 03:45:04        2        1
3   2013-12-09 03:45:04        2        1
4   2013-12-25 03:45:04        2        1
5   2013-12-31 03:45:04        2        1
6   2014-01-08 03:45:04        2        1
7   2014-02-03 03:45:04        2        1
8   2014-02-08 03:45:04        2        1
9   2014-02-09 03:45:04        2        1
10  2014-02-13 03:45:04        2        1
11  2014-02-16 03:45:04        2        1
12  2014-03-09 03:45:04        2        1
13  2014-03-13 03:45:04        2        1
14  2014-03-31 03:45:04        2        1
15  2013-03-19 23:14:52        3        1
16  2013-05-22 08:09:28        4        1
17  2013-01-22 10:14:20        5        1
18  2013-12-19 03:37:06        6        1
19  2012-12-20 13:24:32        7        1

In [98]:
user_df.head()

,object_id,creation_time,name,email,creation_source,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id
0,1,2014-04-22 03:53:30,Clausen August,AugustCClausen@yahoo.com,GUEST_INVITE,1.398139e+09,1,0,11,10803.0
1,2,2013-11-15 03:45:04,Poole Matthew,MatthewPoole@gustr.com,ORG_INVITE,1.396238e+09,0,0,1,316.0
2,3,2013-03-19 23:14:52,Bottrill Mitchell,MitchellBottrill@gustr.com,ORG_INVITE,1.363735e+09,0,0,94,1525.0
3,4,2013-05-21 08:09:28,Clausen Nicklas,NicklasSClausen@yahoo.com,GUEST_INVITE,1.369210e+09,0,0,1,5151.0
4,5,2013-01-17 10:14:20,Raw Grace,GraceRaw@yahoo.com,GUEST_INVITE,1.358850e+09,0,0,193,5240.0

In [99]:
#surely we don't need last_session_creation time anyway right? This was causing me an issue with reading in from csv
user_df = user_df.drop(columns = 'last_session_creation_time')

In [100]:
eng_df['user_id'].nunique()

8823

In [101]:
#so the first thing we can do is try to group the data into days, get rid of the time of day
eng_df['time_stamp'] = pd.to_datetime(eng_df['time_stamp']) - pd.to_timedelta(1, unit='d')
eng_df = eng_df.groupby(['user_id', pd.Grouper(key='time_stamp', freq='W-MON')]).sum().reset_index().sort_values('user_id')

In [90]:
eng_df.head()

   user_id time_stamp  visited
0        1 2014-04-21        1
1        2 2013-11-18        1
2        2 2013-12-02        1
3        2 2013-12-09        1
4        2 2013-12-30        2